CodeIgniter4/CodeIgniter4-4.2.1/app/Controllers/Home.php

    public function index()
    {


        $db = \Config\Database::connect();

        $data = [
            'nome' => 'samuelOliveira',
            'email' => 'samuel@teste.com',
            'senha' => password_hash('86375297', PASSWORD_DEFAULT)
        ];

        $interted = $db->table('users')->insert($data);
---
INSERT INTO `users` (`nome`, `email`, `senha`) VALUES ('samuelOliveira', 'samuel@teste.com', '$2y$10$TLxVdTMbFlVhg/Zm7IAaxOKvrcRjnabIXIJTreEcsDWC/cI72KcXm')